/*==========================================================================================================================================================

														ëêå¥ï\é¶èàóù[grassland.h]
															Author:ïΩ‡Véçâë

============================================================================================================================================================*/
#ifndef _GRASSLAND_H_
#define _GRASSLAND_H_

#include "main.h"

void InitGrassLand(void);
void LoadGrassLand(void);

void UninitGrassLand(void);
void DrawGrassLand(void);

#endif 