/*==========================================================================================================================================================

														É^ÉCÉgÉãâÊñ èàóù[title.h]
															Author:ïΩ‡Véçâë

============================================================================================================================================================*/
#ifndef _TITLE_H_
#define _TITLE_H_

void InitTitle(void);
void LoadTitle(void);

void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif